{
  "category": "Books",
  "date": "2019/4/8",
  "products": [
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Right-Side-History-Reason-Purpose/dp/0062857908/ref=sr_1_1?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-1",
      "name": "The Right Side of History: How Reason and Moral Purpose Made the West Great",
      "id": "978-0062857903",
      "listPrice": 16.79,
      "description": "America has a God-shaped hole in its heart, argues New York Times bestselling author Ben Shapiro, and we shouldn't fill it with politics and hate.In 2016, Ben Shapiro spoke at UC Berkeley. Hundreds of police officers were required from 10 UC campuses across the state to protect his speech, which was -- ironically -- about the necessity for free speech and rational debate. He came to argue that Western Civilization is in the midst of a crisis of purpose and ideas. Our freedoms are built upon the twin notions that every human being is made in God’s image and that human beings were created with reason capable of exploring God’s world. We can thank these values for the birth of science, the dream of progress, human rights, prosperity, peace, and artistic beauty. Jerusalem and Athens built America, ended slavery, defeated the Nazis and the Communists, lifted billions from poverty and gave billions spiritual purpose. Jerusalem and Athens were the foundations of the Magna Carta and the Treaty of Westphalia; they were the foundations of Declaration of Independence, Abraham Lincoln’s Emancipation Proclamation, and Martin Luther King Jr.’s Letter from Birmingham Jail.Civilizations that rejected Jerusalem and Athens have collapsed into dust. The USSR rejected Judeo-Christian values and Greek natural law, substituting a new utopian vision of “social justice” – and they starved and slaughtered tens of millions of human beings. The Nazis rejected Judeo-Christian values and Greek natural law, and they shoved children into gas chambers. Venezuela rejects Judeo-Christian values and Greek natural law, and citizens of their oil-rich nation have been reduced to eating dogs.  We are in the process of abandoning Judeo-Christian values and Greek natural law, favoring instead moral subjectivism and the rule of passion. And we are watching our civilization collapse into age-old tribalism, individualistic hedonism, and moral subjectivism. We believe we can reject Judeo-Christian values and Greek natural law and satisfy ourselves with intersectionality, or scientific materialism, or progressive politics, or authoritarian governance, or nationalistic solidarity. We can’t.The West is special, and in The Right Side of History, Ben Shapiro bravely explains that it’s because too many of us have lost sight of the moral purpose that drives us each to be better, or the sacred duty to work together for the greater good, or both. A stark warning, and a call to spiritual arms, this book may be the first step in getting our civilization back on track. ",
      "productDimensions": "6 x 1 x 9 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/41yBdNVtIuL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51n2ROU87CL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "15.2 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Supermarket-Bobby-Hall/dp/1982127139/ref=sr_1_2?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-2",
      "name": "Supermarket",
      "id": "978-1982127138",
      "listPrice": 10.79,
      "description": "The stunning debut novel from one of the most creative artists of our generation, Bobby Hall, a.k.a. Logic.  “Bobby Hall has crafted a mind-bending first novel, with prose that is just as fierce and moving as his lyrics. Supermarket is like Naked Lunch meets One Flew Over the Cuckoo's Nest—if they met at Fight Club.”—Ernest Cline, #1 New York Times Bestselling author of Ready Player OneFlynn is stuck—depressed, recently dumped, and living at his mom’s house. The supermarket was supposed to change all that. An ordinary job and a steady check. Work isn’t work when it’s saving you from yourself. But things aren’t quite as they seem in these aisles. Arriving to work one day to a crime scene, Flynn’s world collapses as the secrets of his tortured mind are revealed. And Flynn doesn’t want to go looking for answers at the supermarket. Because something there seems to be looking for him. A darkly funny psychological thriller, Supermarket is a gripping exploration into madness and creativity. Who knew you could find sex, drugs, and murder all in aisle nine?Age Range:Adult",
      "productDimensions": "8 x 5 x 8 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/31ILgGAxYML._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-848f2djL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/21e0uSHjleL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "7.8 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Path-Made-Clear-Discovering-Direction/dp/1250307503/ref=sr_1_3?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-3",
      "name": "The Path Made Clear: Discovering Your Life's Direction and Purpose",
      "id": "978-1250307507",
      "listPrice": 16.75,
      "description": "Everyone has a purpose. And, according to Oprah Winfrey, “Your real job in life is to figure out as soon as possible what that is, who you are meant to be, and begin to honor your calling in the best way possible.” That journey starts right here.In her latest book, The Path Made Clear, Oprah shares what she sees as a guide for activating your deepest vision of yourself, offering the framework for creating not just a life of success, but one of significance. The book’s ten chapters are organized to help you recognize the important milestones along the road to self-discovery, laying out what you really need in order to achieve personal contentment, and what life’s detours are there to teach us. Oprah opens each chapter by sharing her own key lessons and the personal stories that helped set the course for her best life. She then brings together wisdom and insights from luminaries in a wide array of fields, inspiring readers to consider what they’re meant to do in the world and how to pursue it with passion and focus. Renowned figures such as Eckhart Tolle, Brene Brown, Lin-Manuel Miranda, Elizabeth Gilbert, Jay-Z, and Ellen DeGeneres share the greatest lessons from their own journeys toward a life filled with purpose.Paired with over 100 awe-inspiring photographs to help illuminate the wisdom of these messages, The Path Made Clear provides readers with a beautiful resource for achieving a life lived in service of your calling – whatever it may be.Age Range:Adult",
      "productDimensions": "6.7 x 1.1 x 8.3 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/61vY7Ehm7GL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.2 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Matriarch-Barbara-Making-American-Dynasty/dp/1538713640/ref=sr_1_4?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-4",
      "name": "The Matriarch: Barbara Bush and the Making of an American Dynasty",
      "id": "978-1538713648",
      "listPrice": 19.5,
      "description": "A vivid biography of former First Lady Barbara Bush, one of the most influential and under-appreciated women in American political history. Barbara Pierce Bush was one of the country's most popular and powerful figures, yet her full story has never been told.THE MATRIARCH tells the riveting tale of a woman who helped define two American presidencies and an entire political era. Written by USA TODAY's Washington Bureau chief Susan Page, this biography is informed by more than one hundred interviews with Bush friends and family members, hours of conversation with Mrs. Bush herself in the final six months of her life, and access to her diaries that spanned decades. THE MATRIARCH examines not only her public persona but also less well-known aspects of her remarkable life. As a girl in Rye, New York, Barbara Bush weathered criticism of her weight from her mother, barbs that left lifelong scars. As a young wife, she coped with the death of her three-year-old daughter from leukemia, a loss that changed her forever. In middle age, she grappled with depression so serious that she contemplated suicide. And as first the wife and then the mother of American presidents, she made history as the only woman to see -- and advise -- both her husband and son in the Oval Office. As with many women of her era, Barbara Bush was routinely underestimated, her contributions often neither recognized nor acknowledged. But she became an astute and trusted political campaign strategist and a beloved First Lady. She invested herself deeply in expanding literacy programs in America, played a critical role in the end of the Cold War, and led the way in demonstrating love and compassion to those with HIV/AIDS. With her cooperation, this book offers Barbara Bush's last words for history -- on the evolution of her party, on the role of women, on Donald Trump, and on her family's legacy.Barbara Bush's accomplishments, struggles, and contributions are many. Now, Susan Page explores them all in THE MATRIARCH, a groundbreaking book certain to cement Barbara Bush as one of the most unique and influential women in American history.Age Range: Adult",
      "productDimensions": "6.4 x 1.5 x 9.2 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51NBPfyNlTL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.5 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Love-Letter-Life-Creatively-Intentionally/dp/0310353629/ref=sr_1_5?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-5",
      "name": "A Love Letter Life: Pursue Creatively. Date Intentionally. Love Faithfully.",
      "id": "978-0310353621",
      "listPrice": 12.2,
      "description": "More than 2.3 million people watched as Jeremy and Audrey Roloff shared their vows and committed their lives to each other. Now for the first time, the former co-stars of TLC's hit show Little People, Big World share their imperfect, resilient, and inspiring love story.As Jeremy and Audrey write, if you can fall into love, you can fall out. True love is something you choose to live out each day through your actions, decisions, and sacrifices. To find and still seek, now that is love. From the moment you meet your potential spouse, you can be intentional about shaping a beautiful love story, uniquely written for who God created you both to be. Whether you're single and searching, in a serious dating relationship, or desiring to love your spouse better, Jeremy and Audrey equip you to pursue an intentional, creative, and faithful love story by sharing theirs.The journey to their wedding day was the culmination of a bumpy and complicated dating relationship. From health problems, to emotional walls, to being separated by one thousand miles, the couple faced daunting obstacles. But their unique approach to dating empowered them to write an uncommon love story and prepared them for married life. Because as beautiful as their wedding was, the Roloffs made a point to prepare more for their marriage than their wedding day.Told through both Jeremy's and Audrey's voices, A Love Letter Life tells a passionate and persevering story of relatable struggles, hard-learned lessons, practical tips, and devout commitment. In these pages, they encourage you to stop settling for convenient relationships, offer perspective on male and female differences in dating, tackle tough topics like purity, give their nine rules for fighting well, suggest fun ideas for connection in a world of technology, and provide fresh advice on how to intentionally pursue a love story that never ends.",
      "productDimensions": "6.2 x 0.9 x 9.3 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51CPrUtzKRL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41677jj7niL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41sTE6sE%2B2L._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "14.1 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Home-Edit-Organizing-Realizing-Refrigerator/dp/0525572643/ref=sr_1_6?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-6",
      "name": "The Home Edit: A Guide to Organizing and Realizing Your House Goals (Includes Refrigerator  Labels)",
      "id": "978-0525572640",
      "listPrice": 12.35,
      "description": "NEW YORK TIMES BESTSELLER • There’s decorating, and then there’s organizing. From the Instagram-sensation home experts (with a serious fan club that includes Reese Witherspoon, Gwyneth Paltrow, and Mindy Kaling), here is an accessible, room-by-room guide to establishing new order in your home.Believe this: every single space in your house has the potential to function efficiently and look great. The mishmash of summer and winter clothes in the closet? Yep. Even the dreaded junk drawer? Consider it done. And the best news: it’s not hard to do—in fact, it's a lot of fun.  From the home organizers who made their orderly eye candy the method that everyone swears by comes Joanna and Clea’s signature approach to decluttering. The Home Edit walks you through paring down your belongings in every room, arranging them in a stunning and easy-to-find way (hello, labels!), and maintaining the system so you don't need another do-over in six months. When you're done, you'll not only know exactly where to find things, but you'll also love the way it looks. A masterclass and look book in one, The Home Edit is filled with bright photographs and detailed tips, from placing plastic dishware in a drawer where little hands can reach to categorizing pantry items by color (there's nothing like a little ROYGBIV to soothe the soul). Above all, it's like having your best friends at your side to help you turn the chaos into calm.PLEASE NOTE: The paperback includes a starter set of labels for your refrigerator; the ebook and audiobook include a link to download and print the labels from a computer (you will need 8-1/2 x 11-inch clear repositionable sticker project paper, such as Avery 4397).Featured in Glamour's 10 Books to Help You Live Your Best Life",
      "productDimensions": "7.1 x 0.8 x 10 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51Clxy0FIgL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41UjncMXCvL._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DgQZoFW2L._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41aw9-0DGiL._AC_SY60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.6 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/We-Are-Gardeners-Joanna-Gaines/dp/1400314224/ref=sr_1_7?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-7",
      "name": "We Are the Gardeners",
      "id": "978-1400314225",
      "listPrice": 11.95,
      "description": "In We Are the Gardeners, Joanna and the kids chronicle the adventures of starting their own family garden. From their failed endeavors, obstacles to overcome (bunnies that eat everything!), and all the knowledge they've gained along the way, the Gaines family shares how they learned to grow a happy, successful garden. As it turns out, trying something new isn't always easy, but the hardest work often yields the greatest reward. There are always new lessons to be learned in the garden!You and your children can learn all about the Gaines family's story of becoming gardeners in Joanna's first children’s book—starting with the first little fern Chip bought for Jo. Over the years, the family's love for gardening blossomed into what is now a beautiful, bustling garden.Julianna Swaney’s illustrations bring the Gaines family garden to life with colorful, whimsical watercolors and invite you to enjoy the beauty of a thriving garden.",
      "productDimensions": "9.3 x 0.4 x 11.2 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51FdaXkoETL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41eq%2BSfWWzL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Xbn4EfS8L._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41PzBY60HBL._AC_SY60_CR,0,0,60,60_.jpg"
      ],
      "weight": "14.9 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Commander-Cheat-Golf-Explains-Trump/dp/0316528080/ref=sr_1_8?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-8",
      "name": "Commander in Cheat: How Golf Explains Trump",
      "id": "978-0316528085",
      "listPrice": 17.32,
      "description": "An outrageous indictment of Donald Trump's appalling behavior when it comes to golf -- on and off the green -- and what it reveals about his character.  Donald Trump loves golf. He loves to play it, buy it, build it, and operate it. He owns 14 courses around the world and runs another five, all of which he insists are the best on the planet. He also claims he's a 3 handicap, almost never loses, and has won an astonishing 18 club championships. How much of all that is true? Almost none of it, acclaimed sportswriter Rick Reilly reveals in this unsparing look at Trump in the world of golf. Based on Reilly's own experiences with Trump as well as interviews with over 100 golf pros, amateurs, developers, and caddies, Commander in Cheat is a startling and at times hilarious indictment of Trump and his golf game. You'll learn how Trump cheats (sometimes with the help of his caddies and Secret Service agents), lies about his scores (the \"Trump Bump\"), tells whoppers about the rank of his courses and their worth (declaring that every one of them is worth $50 million), and tramples the etiquette of the game (driving on greens doesn't help). Trump doesn't brag so much, though, about the golf contractors he stiffs, the course neighbors he intimidates, or the way his golf decisions wind up infecting his political ones. For Trump, it's always about winning. To do it, he uses the tricks he picked up from the hustlers at the public course where he learned the game as a college kid, and then polished as one of the most bombastic businessmen of our time. As Reilly writes, \"Golf is like bicycle shorts. It reveals a lot about a man.\" Commander in Cheat \"paints a side-splitting portrait of a congenital cheater\" (Esquire), revealing all kinds of unsightly truths Trump has been hiding. ",
      "productDimensions": "6.4 x 1 x 9.4 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/419tPLOqejL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "15.4 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Eat-Beat-Disease-Science-Itself/dp/1538714620/ref=sr_1_9?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-9",
      "name": "Eat to Beat Disease: The New Science of How Your Body Can Heal Itself",
      "id": "978-1538714621",
      "listPrice": 19.49,
      "description": "Is your diet feeding or defeating disease? Forget everything you think you know about your body and food, and discover the new science of how the body heals itself. Learn how to identify the strategies and the dosages for using food to transform your resilience and health in EAT TO BEAT DISEASE.We have radically underestimated our body's power to transform and restore our health. Pioneering physician scientist, Dr. William Li, empowers readers by showing them the evidence behind over 200 health-boosting foods that can starve cancer, reduce your risk of dementia, and beat dozens of avoidable diseases. EAT TO BEAT DISEASE isn't about what foods to avoid, but rather is a life-changing guide to the hundreds of healing foods to add to your meals that support the body's defense systems, including:PlumsCinnamonJasmine teaRed wine and beerBlack BeansSan Marzano tomatoesOlive oilPacific oystersCheeses like Jarlsberg, Camembert and cheddarSourdough breadThe book's plan shows you how to integrate the foods you already love into any diet or health plan to activate your body's health defense systems-Angiogenesis, Regeneration, Microbiome, DNA Protection, and Immunity-to fight cancer, diabetes, cardiovascular, neurodegenerative, and autoimmune diseases, and other debilitating conditions.Both informative and practical, EAT TO BEAT DISEASE explains the science of healing and prevention, the strategies for using food to actively transform health, and points the science of well-being and disease prevention in an exhilarating new direction. ",
      "productDimensions": "6.6 x 1.8 x 9.4 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/41O5iJ4F%2B0L._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.5 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Next-Right-Thing-Practice-Decisions/dp/0800736524/ref=sr_1_10?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-10",
      "name": "The Next Right Thing: A Simple, Soulful Practice for Making Life Decisions",
      "id": "978-0800736521",
      "listPrice": 12.23,
      "description": "Nothing gets our attention like an unmade decision: Should I accept the new position? Which schooling choice is best for my kids? How can I support my aging parents? When we have a decision to make and the answer isn't clear, what we want more than anything is peace, clarity, and a nudge in the right direction. If you have trouble making decisions, because of either chronic hesitation you've always lived with or a more recent onset of decision fatigue, Emily P. Freeman offers a fresh way of practicing familiar but often forgotten advice: simply do the next right thing. With this simple, soulful practice, it is possible to clear the decision-making chaos, quiet the fear of choosing wrong, and find the courage to finally decide without regret or second-guessing.Whether you're in the midst of a major life transition or are weary of the low-grade anxiety that daily life can bring, Emily helps create space for your soul to breathe so you can live life with God at a gentle pace and discern your next right thing in love.",
      "productDimensions": "6.5 x 0.9 x 9.4 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/41oDqrkhw-L._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41oP31mI2OL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Maybe-You-Should-Talk-Someone/dp/1328662055/ref=sr_1_11?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-11",
      "name": "Maybe You Should Talk to Someone: A Therapist, HER Therapist, and Our Lives Revealed",
      "id": "978-1328662057",
      "listPrice": 12.49,
      "description": "Now being developed as a television series with Eva Longoria and ABC!*An O, The Oprah Magazine's Best Nonfiction Book of 2019*  *An Apple Best Books Pick for April**An April IndieNext Pick**A Book of the Month Club Selection**A Publishers Marketplace Buzz Book**A Newsday, Apple iBooks, Thrive Global, Refinery29, and Book Riot Most Anticipated Book of 2019*\"An irresistibly addictive tour of the human condition.\"--Kirkus, starred review\"Rarely have I read a book that challenged me to see myself in an entirely new light, and was at the same time laugh-out-loud funny and utterly absorbing.\"--Katie Couric\"This is a daring, delightful, and transformative book.\"--Arianna Huffington, Founder, Huffington Post and Founder & CEO, Thrive Global\"Wise, warm, smart, and funny. You must read this book.\"--Susan Cain, New York Times bestselling author of QuietFrom a New York Times best-selling author, psychotherapist, and national advice columnist, a hilarious, thought-provoking, and surprising new book that takes us behind the scenes of a therapist's world--where her patients are looking for answers (and so is she).One day, Lori Gottlieb is a therapist who helps patients in her Los Angeles practice. The next, a crisis causes her world to come crashing down. Enter Wendell, the quirky but seasoned therapist in whose of­fice she suddenly lands. With his balding head, cardigan, and khakis, he seems to have come straight from Therapist Central Casting. Yet he will turn out to be anything but.As Gottlieb explores the inner chambers of her patients' lives -- a self-absorbed Hollywood producer, a young newlywed diagnosed with a terminal illness, a senior citizen threatening to end her life on her birthday if nothing gets better, and a twenty-something who can't stop hooking up with the wrong guys -- she finds that the questions they are struggling with are the very ones she is now bringing to Wendell.With startling wisdom and humor, Gottlieb invites us into her world as both clinician and patient, examining the truths and fictions we tell ourselves and others as we teeter on the tightrope between love and desire, meaning and mortality, guilt and redemption, terror and courage, hope and change.Maybe You Should Talk to Someone is rev­olutionary in its candor, offering a deeply per­sonal yet universal tour of our hearts and minds and providing the rarest of gifts: a boldly reveal­ing portrait of what it means to be human, and a disarmingly funny and illuminating account of our own mysterious lives and our power to transform them. ",
      "productDimensions": "6.2 x 1.2 x 9.2 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51OBv43TthL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51e%2B-SGLofL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.4 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Ladies-Who-Punch-Explosive-Inside/dp/1250112095/ref=sr_1_12?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-12",
      "name": "Ladies Who Punch: The Explosive Inside Story of \"The View\"",
      "id": "978-1250112095",
      "listPrice": 17.39,
      "description": "Like Fire & Fury, the gossipy real-life soap opera behind a serious show. When Barbara Walters launched The View, network executives told her that hosting it would tarnish her reputation. Instead, within ten years, she’d revolutionized morning TV and made household names of her co-hosts: Joy Behar, Star Jones, Meredith Vieira and Elisabeth Hasselbeck. But the daily chatfest didn’t just comment on the news. It became the news. And the headlines barely scratched the surface.Based on unprecedented access, including stunning interviews with nearly every host, award-winning journalist Ramin Setoodeh takes you backstage where the stars really spoke their minds. Here's the full story of how Star, then Rosie, then Whoopi tried to take over the show, while Barbara struggled to maintain control of it all, a modern-day Lear with her media-savvy daughters. You'll read about how so many co-hosts had a tough time fitting in, suffered humiliations at the table, then pushed themselves away, feeling betrayed―one nearly quitting during a commercial. Meanwhile, the director was being driven insane, especially by Rosie.Setoodeh uncovers the truth about Star’s weight loss and wedding madness. Rosie’s feud with Trump. Whoopi’s toxic relationship with Rosie. Barbara’s difficulty stepping away. Plus, all the unseen hugs, snubs, tears―and one dead rodent.Ladies Who Punch shows why The View can be mimicked and mocked, but it can never be matched.",
      "productDimensions": "6.4 x 1.3 x 9.6 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/41cOKdI45LL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41kJ9W%2BdeYL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.2 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Hashimotos-Food-Pharmacology-Nutrition-Protocols/dp/0062571591/ref=sr_1_13?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-13",
      "name": "Hashimoto’s Food Pharmacology: Nutrition Protocols and Healing Recipes to Take Charge of Your Thyroid Health",
      "id": "978-0062571595",
      "listPrice": 19.19,
      "description": "“When I was in pharmacy school, I discovered that food has a profound impact on our healing and that what we put in our bodies will either heal us or make us sicker. In the same way that we use pharmaceuticals to impact our biology, we can use food as our medicine. I call this concept food pharmacology. Food is one of the most powerful tools in your healing journey.” - Dr. Izabella WentzMore than 35 million Americans currently suffer from Hashimoto’s—the country’s fastest-growing autoimmune disease, which affects the thyroid gland and causes the body to attack its own cells. Many individuals with or without a formal diagnosis suffer daily symptoms, including chronic cough, acid reflux, irritable bowel syndrome, allergies, persistent pain, hair loss, brain fog, and forgetfulness. Hashimoto’s Food Pharmacology combines Dr. Izabella Wentz’s revolutionary and proven approach to reversing thyroid symptoms with delicious, easy-to-use recipes that delight the taste buds while they heal the body. Inside you will discover:• 125 delicious and nutritious recipes for salads, smoothies, bone broths and crockpot and bibimbap-style meals, with thyroid-supporting nutrient details on every page• Over 100 stunning food and lifestyle photographs• Tips for revamping your kitchen and pantry• An FAQ for easy reference and quick answers• Easy-to-use, personalized meal plans and food rotation schedules to accommodate any diet Successfully transforming the lives of thousands, Dr. Izabella Wentz makes it easier than ever before to live a life free from the suffering of autoimmune disease.",
      "productDimensions": "7.4 x 1.2 x 9.1 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51EbzgTyXGL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Mh0mAt3pL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41H4OWB-sjL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ArigvlUeL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "2.6 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Longevity-Paradox-Young-Ripe-Plant/dp/0062843397/ref=sr_1_14?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-14",
      "name": "The Longevity Paradox: How to Die Young at a Ripe Old Age (The Plant Paradox)",
      "id": "978-0062843395",
      "listPrice": 17.39,
      "description": "From the author of the New York Times bestseller The Plant Paradox comes a groundbreaking plan for living a long, healthy, happy life.From the moment we are born, our cells begin to age. But aging does not have to mean decline. World-renowned surgeon Dr. Steven Gundry has been treating mature patients for most of his career. He knows that everyone thinks they want to live forever, until they hit middle age and witness the suffering of their parents and even their peers. So how do we solve the paradox of wanting to live to a ripe old age—but enjoy the benefits of youth?This groundbreaking book holds the answer. Working with thousands of patients, Dr. Gundry has discovered that the “diseases of aging” we most fear are not simply a function of age; rather, they are a byproduct of the way we have lived over the decades. In The Longevity Paradox, he maps out a new approach to aging well—one that is based on supporting the health of the “oldest” parts of us: the microorganisms that live within our bodies.Our gut bugs—the bacteria that make up the microbiome—largely determine our health over the years. From diseases like cancer and Alzheimer’s to common ailments like arthritis to our weight and the appearance of our skin, these bugs are in the driver’s seat, controlling our quality of life as we age.The good news is, it’s never too late to support these microbes and give them what they need to help them—and you—thrive. In The Longevity Paradox, Dr. Gundry outlines a nutrition and lifestyle plan to support gut health and live well for decades to come. A progressive take on the new science of aging, The Longevity Paradox offers an action plan to prevent and reverse disease as well as simple hacks to help anyone look and feel younger and more vital.",
      "productDimensions": "6 x 1.2 x 9 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/41AHi1IV5mL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.2 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Doing-Justice-Prosecutors-Thoughts-Punishment/dp/0525521127/ref=sr_1_15?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-15",
      "name": "Doing Justice: A Prosecutor's Thoughts on Crime, Punishment, and the Rule of Law",
      "id": "978-0525521129",
      "listPrice": 16.77,
      "description": "By the one-time federal prosecutor for the Southern District of New York, an important overview of the way our justice system works, and why the rule of law is essential to our society. Using case histories, personal experiences and his own inviting writing and teaching style, Preet Bharara shows the thought process we need to best achieve truth and justice in our daily lives and within our society.Preet Bharara has spent much of his life examining our legal system, pushing to make it better, and prosecuting those looking to subvert it. Bharara believes in our system and knows it must be protected, but to do so, we must also acknowledge and allow for flaws in the system and in human nature.     The book is divided into four sections: Inquiry, Accusation, Judgment and Punishment. He shows why each step of this process is crucial to the legal system, but he also shows how we all need to think about each stage of the process to achieve truth and justice in our daily lives.     Bharara uses anecdotes and case histories from his legal career--the successes as well as the failures--to illustrate the realities of the legal system, and the consequences of taking action (and in some cases, not taking action, which can be just as essential when trying to achieve a just result).      Much of what Bharara discusses is inspiring--it gives us hope that rational and objective fact-based thinking, combined with compassion, can truly lead us on a path toward truth and justice. Some of what he writes about will be controversial and cause much discussion. Ultimately, it is a thought-provoking, entertaining book about the need to find the humanity in our legal system--and in our society.",
      "productDimensions": "6 x 1.2 x 9.5 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/41q005624bL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.3 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Raise-Your-Hand-Alice-Tapper/dp/1524791202/ref=sr_1_16?fst=as%3Aoff&qid=1554753508&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-16",
      "name": "Raise Your Hand",
      "id": "978-1524791209",
      "listPrice": 10.96,
      "description": "11-year-old Alice Paul Tapper--daughter of CNN's Jake Tapper--is challenging girls everywhere to speak up!When Alice Tapper noticed that the girls in her class weren't participating as much as the boys, she knew she had to do something about it. With help from her Girl Scout troop and her parents, she came up with a patch that other girls could earn if they took a pledge to be more confident in school. Alice even wrote an op-ed about the experience for the New York Times! Inspired by that piece, this picture book illustrates her determination, bravery, and unwillingness to accept the status quo. With Marta Kissi's delightful illustrations depicting Alice's story, young readers everywhere will want to follow Alice's lead and raise their hand!",
      "productDimensions": "9 x 9 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/61ODS7cllqL._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51WBIsDCYTL._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HAQxgpr3L._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41iER3XBR5L._AC_SY60_CR,0,0,60,60_.jpg"
      ],
      "weight": "9.6 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Dont-Them-Disappear-Chelsea-Clinton/dp/0525514325/ref=sr_1_17?fst=as%3Aoff&qid=1554753608&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-17",
      "name": "Don't Let Them Disappear",
      "id": "978-0525514329",
      "listPrice": 11.04,
      "description": "From the author of the #1 New York Times bestseller She Persisted comes a beautiful book about the animals who share our planet--and what we can do to help them survive.Did you know that blue whales are the largest animals in the world? Or that sea otters wash their paws after every meal? The world is filled with millions of animal species, and all of them are unique and special. Many are on the path to extinction.In this book, Chelsea Clinton introduces young readers to a selection of endangered animals, sharing what makes them special, and also what threatens them. Taking readers through the course of a day, Don't Let Them Disappear talks about rhinos, tigers, whales, pandas and more, and provides helpful tips on what we all can do to help prevent these animals from disappearing from our world entirely.With warm and engaging art by Gianna Marino, this book is the perfect read for animal-lovers and anyone who cares about our planet.Praise for Don't Let Them Disappear:\"A winning heads up for younger readers just becoming aware of the wider natural world.\" --Kirkus Reviews\"An inviting . . . appeal to care for the planet and its most vulnerable creatures.\" --Publishers Weekly",
      "productDimensions": "9.4 x 0.4 x 11.3 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51j1i%2BevMUL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41CrjshhKJL._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41K5okzFooL._AC_SY60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51wkeJZ1HjL._AC_SY60_CR,0,0,60,60_.jpg"
      ],
      "weight": "13.8 ounces"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Run-Away-Harlan-Coben/dp/1538748460/ref=sr_1_18?fst=as%3Aoff&qid=1554753608&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-18",
      "name": "Run Away",
      "id": "978-1538748466",
      "listPrice": 13.41,
      "description": "A perfect family is shattered in RUN AWAY, the new thriller from the master of domestic suspense, Harlan Coben.You've lost your daughter.  She's addicted to drugs and to an abusive boyfriend. And she's made it clear that she doesn't want to be found.  Then, by chance, you see her playing guitar in Central Park. But she's not the girl you remember. This woman is living on the edge, frightened, and clearly in trouble.  You don't stop to think. You approach her, beg her to come home.  She runs.   And you do the only thing a parent can do: you follow her into a dark and dangerous world you never knew existed. Before you know it, both your family and your life are on the line. And in order to protect your daughter from the evils of that world, you must face them head on.Age Range:Adult.",
      "productDimensions": "6.2 x 1.2 x 9.4 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51GWPea6icL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.3 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/IMomSoHard-Kristin-Hensley/dp/006285769X/ref=sr_1_19?fst=as%3Aoff&qid=1554753608&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-19",
      "name": "#IMomSoHard",
      "id": "978-0062857699",
      "listPrice": 17.1,
      "description": "Has it been months since you’ve read a book with actual adult words that had nothing to do with farm animals or superheroes or going potty? Well then, it’s time to take a break. Pour yourself some wine. Put on your comfy pants. All good? Ok, welcome to the party.Kristin Hensley and Jen Smedley, the creators of #IMOMSOHARD, know that you probably didn’t get to shower today and that the last thing you need is more advice on how to be a better parent. Instead, they invite you to join their laugh-out-loud, best friend banter on the eighty bajillion ways moms give their all every day—including:I KEEP IT TOGETHER SO HARDI BODY AFTER BABY SO HARDI HIT THE TOWN (AND AM IN BED BY 9:30 P.M.) SO HARDI BUST MY ASS SO HARDI KEEP FOOLS ALIVE SO HARDCome for the laughs, stay for the kinship with two friends who are just getting it right, getting it wrong, and leaning on each other for a laugh at the end of the day. They don’t care if your house is a mess and they won’t judge you if you pee a little when you sneeze. So kick back, relax, and enjoy. You deserve it.  ",
      "productDimensions": "6 x 1 x 9 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51znEjnrJxL._AC_SX60_CR,0,0,60,60_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41WPabQZRGL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "1.2 pounds"
    },
    {
      "category": "Books",
      "listing": "Last 30 days",
      "sourceURL": "https://www.amazon.com/Cost-These-Dreams-Stories-Business/dp/014313387X/ref=sr_1_20?fst=as%3Aoff&qid=1554753608&refinements=p_n_publication_date%3A1250226011&rnid=1250225011&s=books&sr=1-20",
      "name": "The Cost of These Dreams: Sports Stories and Other Serious Business",
      "id": "978-0143133872",
      "listPrice": 10.8,
      "description": "From one of America's most beloved sportswriters, a collection of true stories about the dream of greatness and its cost in the world of sports.\"Wright Thompson's stories are so full of rich characters, bad actors, heroes, drama, suffering, courage, conflict, and vivid detail that I sometimes thinks he's working my side of the street - the world of fiction.\" - John GrishamThere is only one Wright Thompson. He is, as they say, famous if you know who he is: his work includes the most read articles in the history of ESPN (and it's not even close) and has been anthologized in the Best American Sports Writing series ten times, and he counts John Grisham and Richard Ford among his ardent admirers (see back of book). But to say his pieces are about sports, while true as far as it goes, is like saying Larry McMurtry's Lonesome Dove is a book about a cattle drive. Wright Thompson figures people out. He jimmies the lock to the furnaces inside the people he profiles and does an analysis of the fuel that fires their ambition. Whether it be Michael Jordan or Tiger Woods or Pat Riley or Urban Meyer, he strips the away the self-serving myths and fantasies to reveal his characters in full. There are fascinating common denominators: it may not be the case that every single great performer or coach had a complex relationship with his father, but it can sure seem that way. And there is much marvelous local knowledge: about specific sports, and times and places, and people. Ludicrously entertaining and often powerfully moving, The Cost of These Dreams is an ode to the reporter's art, and a celebration of true greatness and the high price that it exacts.",
      "productDimensions": "5.5 x 8.4 inches",
      "imageURLs": [
        "https://images-na.ssl-images-amazon.com/images/I/51hhEO%2BsKRL._AC_SX60_CR,0,0,60,60_.jpg"
      ],
      "weight": "11 ounces"
    }
  ]
}